using Microsoft.VisualBasic;
using Microsoft.VisualBasic.CompilerServices;
using System;
using System.Runtime.CompilerServices;

namespace WL.基础
{
	/// <summary>
	/// 数学相关的模块
	/// </summary>
	[StandardModule]
	public sealed class 数学
	{
		/// <summary>
		/// 随机生成一些物品的类
		/// </summary>
		public sealed class 随机
		{
			protected 随机()
			{
			}

			/// <summary>
			/// 随机获得一个0到0.9999之间的小数
			/// </summary>
			public static float 小数()
			{
				VBMath.Randomize();
				return VBMath.Rnd();
			}

			/// <summary>
			/// 随机获得True或False
			/// </summary>
			public static bool 真假()
			{
				return (double)小数() < 0.5;
			}

			/// <summary>
			/// 获得指定范围内的一个整数
			/// </summary>
			public static int 整数(int A, int B)
			{
				if (A == B)
				{
					return A;
				}
				if (B > A)
				{
					object A2 = A;
					object B2 = B;
					类型.互换(ref A2, ref B2);
					B = Conversions.ToInteger(B2);
					A = Conversions.ToInteger(A2);
				}
				return checked((int)Math.Round(Conversion.Int((float)(A - B + 1) * 小数()) + (float)B));
			}

			/// <summary>
			/// 获得列表当中的随机一个物品
			/// </summary>
			public static object 当中一个(params object[] 列表)
			{
				if (列表.Length < 1)
				{
					return null;
				}
				return 列表[整数(0, checked(列表.Length - 1))];
			}

			/// <summary>
			/// 随机获得文本当中的指定个数个字符，可能会重复，默认为1个
			/// </summary>
			public static string 当中字符(string 文本, uint 个数 = 1u)
			{
				checked
				{
					int num = 文本.Length - 1;
					string text = "";
					if (num >= 0 && unchecked((long)个数) > 0L)
					{
						int num2 = (int)个数;
						for (int i = 1; i <= num2; i++)
						{
							text += 文本[整数(0, num)].ToString();
						}
					}
					return text;
				}
			}

			/// <summary>
			/// 返回指定个阿拉伯数字组成的字符串
			/// </summary>
			public static string 阿拉伯数字(uint 个数 = 1u)
			{
				return 当中字符("0123456789", 个数);
			}

			/// <summary>
			/// 返回指定个阿拉伯数字、小写英文字母、大写英文字母组成的字符串
			/// </summary>
			public static string 西文(uint 个数 = 1u)
			{
				return 当中字符("0123456789abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ", 个数);
			}

			/// <summary>
			/// 返回指定个简体汉字组成的字符串
			/// </summary>
			public static string 简体汉字(uint 个数 = 1u)
			{
				return 当中字符("一丁七丈三上下不丑且世丘丙业丛丝丢两丧个中串丹为主丽之乌乎乐乖乘乙九也乳予争事二云互五井亚些亡交亦京亭亮亲人亿什仁仅仆仇介仍从仓仔他仗付仙令仪们仰价任份仿企伍伏伐休众优伙伞伟传伤伪伯估伴伶伸似但位低住体何余佛作你佣佩佳使侄例侍供依侦侧侨侮侵便促俊俗俘保信俩俭修俯俱倍倒倘候倚借倡倦债倾假偏停健偶偷偿傅傍储催傲傻像僚僵僻儿元兄兆先光克兔兢入全八公六共兵其具典兼兽内册冒军冠冤冬冰冲决况冶冷冻净凉减凑凝几凡凭凳凶凸凹出函凿刀刃分切刊刑划列则刚创初删判利别刮到制刷券刺刻剂剃削前剑剖剥剧剩剪副割劈力功加劣助努劫励劲劳势勇勉勒勤勺匀包匕化北匙匠匪医十午半协卑卒单南博卜占卡卧印即却卵卷卸卿厂厅厕厘厚原厦厨去县又叉及友双反叔取受叙叛口古句叨只叫召叮可台史右叶号叼吃各吉名后吏吐向吓吕吗君吞否吧吨吩含听启吴吵吸吹吼呀呆呈告员呜呢味呼命和咏咐咬咱咳咸咽哀品哄哈响哑哗哥哨哪哭哲唇唉唐唤唯唱啄商啊啦喂喇喉喊喘喝喷嗓嗽嘉嘱嘴器嚣嚷嚼囊囚四回因园困囱围固圆圈土圣在地场圾址均坊坏坐坑块坚坝坟坡坦垂垃垄型垒垦垫垮埋城域培基堂堆堡堤堪堵塌塑塔塘塞填境墓墙增墨壁士壮壶壹复夏夕多夜够大天夫夭夯夷夸夹奇奉奏奔奖套奠奥女奴奶奸她好如妄妈妖妙妥妨妹妻始姐姑姓委姜姥姨姻姿威娃娄娇娘娱婆婚婶嫁嫂嫌嫩子孔孕字孙孝孟季孤孩宁它宅宇守安宋完宏宗官宙定宜宝审客宣室宦宪宫宰害宴宵家容宽宾宿寄密寇富寒察寡寨寸寺寻封射将尉尊小尖尘尚尤尸尺尼尾尿局居屈届屋屑展屠屡屯山屿岔岗岛岩岭岳岸峡峰崇崖崭川州巡巢工左巧巨巩巫己已巴巾布帆希帐帖帘帚帜帝带席帮常帽幅幕干年并幸幺幻幼幽广床序库底店府废度座庭康廉廊延建开弃弄弊弓引弟张弦弯弹强录形彩彪彭影役彻彼往征径待很律徐徒得御循微德心必忆忌忍志忘忙忠忧快念忽态怎怒怕怖怜思怠急性怨怪恋恐恒恢恨恩恭息恰恳恶恼悄悉悔悟悠患悦您悬悲悼情惊惑惕惜惠惧惨惩惭惯惰想惹愁愈愉意愚感愤愧愿慈慌慎慕慢慧慨慰懂懒戈成我戒或战戚截户房所扁扇手才扎扑扒扔托扛扣扩扬扭扮扯扰扶批找承技抄把抓投抖抗折抚抛抢护报披抬抱抵抹押抽担拆拉拌拍拐拒拔拘招拜拢拣拥拦拨择括拳拴拼拾拿持挂指按挎挖挠挡挣挤挥挨挪振挺挽捆捉捎捏捐捕捞损捡换捧据捷掀授掉掌掏排掘掠探接控推掩掰揉描提插握揪揭援搁搂搅搏搜搞搬搭携摄摆摇摊摔摘摧摩摸撇撑撒撕撞撤播操擦攀支收改攻放政故效敌敏救教敞散数敲整文斑斗料斜斤斥斧斩斯新方施旁旅旋族旗既日旦旨旬旭旱时旷旺昂昆昌明昏易昔星映春昨是昼晃晌晒晓晕晚晨景晴晶智暂暑暖暗暮暴曲更最月有朋服朗望朝期木未末本术朱朴朵机朽杀杆李杏材村杜束杠来杨杯松板极构析枕林果枝枣枪枯架柄柏某染柔柜查柱柳柴柿栋栏栗校株样核根格栽桂桃框案桌桐桑档桥桨桶梁梅梢梨梯械梳检棉棋棍棒棕棘棚森棵椅植椒楼概榆榜榨榴槐槽模横樱橘橡欠次欣欧欲欺歇歉歌止正此步武歪歹死歼殃殊残殖段殷殿毁母比毙毛毫毯民气氧水永汁求汗江池污汤汪汽沃沉沙沟没沫河沸油治沾沿泄泉泊泛泡波泥注泪泰泳泻泼泽洁洋洒洗洞津洪洮洲活洽派流浅浆浇浊测济浑浓浙浩浪浮浴海浸涂消涉涌涛涝润涨涩液淋淘淡深混淹添清渐渔渗渠渡渣温港渴游湖湾湿溉源溜溪滋滑滔滚满滤滥滨滩滴漂漆漏演漠漫潜潮澡激灌火灭灯灰灵灶灾灿炉炊炎炒炕炭炮炸炼烂烈烘烛烟烤烦烧烫热焦焰然煌煎煤照煮熄熊熔熟燃燕燥爆爪爬爵父爷爸爹爽版牌牙牛牢牧物牲牵特牺犁犬犯状犹狂狐狗狠狡狭狮狱狸狼猎猛猜猪猫献猴猾率玉王玩环现玻珍珠班球理琴瑞璃瓜瓣瓦瓶甘甜生用田甲申电男畅界畏留略番疆疏疗疤疫疮疯疲疼疾病症痒痕痛痰瘦登白百的皆皇皮皱皿盆盈益盏盐监盒盗盘盛盟目盯盲直相盼盾省眉看真眠眨眯眼着睁睛睡督睬瞎瞒瞧矗矛矢知矩石矿码砌砍研砖破础硬确碌碎碑碗碧碰磁磨示礼社祖祝神祟祥祭祸禁福禽禾秀私秃秆秉秋种科秒秘租秤秧秩积称移稀程稍税稠稳稻稼稿穆穗穴究空穿突窃窄窑窗窜窝立站章竭端竹竿笋笑笔笛符笨第笼等筋筐筑筒答策筛筝筹签简算管箩箭箱篇篮籍米粉粒粗粘粟粤粥粮粱精糊糕糖糟糠系素索紫累絮繁纠红纤约级纪纯纱纲纳纵纷纸纹纺纽线练组细织终绍经绑绒结绕绘给络绝绞统绢绣绩绪续绳维绵绸绿缎缓编缘缝缠缩缴缸缺罐网罕罚罢罩罪置羊美羔羞羡群羹羽翁翅翠翻翼耀老考者而耍耐耕耗耳耽聂聋职聘聚聪肉肌肚肝肠股肢肤肥肩肯育肺肾肿胀胁胃胆背胖胜胞胡胳胶胸能脂脆脉脊脏脑脖脚脱脸脾腊腐腔腥腰腹腾腿膀膊膏膛膜膝膨臂臣自臭至致臼舀舅舌舍舒舞舟航般舰舱船艇艘良艳艺节芒芝芦芬花芳芹芽苍苗若苦英苹茂范茄茅茎茧茫茶草荒荡荣药荷莫莲获莽菊菌菜菠萄萌萍萝营落葛葡董葬葱葵蒙蒜蒸蓄蓝蓬蔑蔬蔽蕉薄薪薯藏虎虏虐虑虫虹虾蚀蚁蚂蚊蚕蛇蛙蛛蛮蛾蜀蜂蜓蜘蜜蜡蜻蝇蝴蝶融螺蠢血行衔街衣补表衫衬衰袄袋袍袖袜被袭裁裂装裕裙裤裳裹西要覆见规视览觉角解言誓警计订认讨让训议讯记讲许论讽设访证评识诉诊词译试诗诚话诞询该详语误诱说诵请诸读课谁调谅谈谊谋谎谜谢谣谦谨谱谷豆象豪貌贝贞负贡财责贤败货质贩贪贫购贯贱贴贵贷贸费贺贼贿资赌赏赔赖赚赛赞赠赢赤赫走赴赶起趁超越趋趟趣足趴跃跌跑距跟跨跪路跳践踏踢踩踪蹄蹈蹦蹲躁身躬躲躺车轧转轮软轰轻载轿较辅辆辈辉输辛辜辞辟辣辨辩辫辰辱辽达迁迅迎运近返进远违连迟迫述迷迹追退适逃逆选透逐递途逗通逝速造逢逮逸逼遇遍道遗遣遥遭遮遵避邀邑那邪邮邻郊郎部都鄙配酒酬酱酷酸酿醉醋醒采释里重量金针钉钓钟钢钥钩钱钳钻铁铃铅铜铲银铸铺链销锁锄锅锈锋锐错锡锣锤锦键锯锹锻镇镜镰长门闪闭问闯闰闲间闷闸闹闻阀阁阅阔队防阳阴阵阶阻阿附降限陕陡院除险陪陵陶陷隆随隐隔隙障隶难雀雁雄雅集雕雨雪零雷雹雾震霉霍霜霞露霸青静靠面革鞋鞠鞭韭音韵页顶顷项顺须顽顾顿颂预领颈频颗题颜额颠颤飘食餐饥饭饮饰饱饲饶饺饼饿馅馆馋馒首香马驮驰驱驳驴驶驻驼驾骂骄骆验骑骗骡骤骨高鬼魂魄魔鱼鲜鸟鸣鸦鸭鸽鹅鹊鹰鹿麦麻黄黍黑默鼎鼓鼠鼻齐齿龄龙龟", 个数);
			}

			/// <summary>
			/// 返回指定个简体汉字组成的字符串
			/// </summary>
			public static string 繁体汉字(uint 个数 = 1u)
			{
				return 当中字符("一丁七丈三上下不醜且世丘丙業叢絲丟兩喪個中串丹為主麗之烏乎樂乖乘乙九也乳予爭事二雲互五井亞些亡交亦京亭亮親人億什仁僅僕仇介仍從倉仔他仗付仙令儀們仰價任份仿企伍伏伐休眾優夥傘偉傳傷偽伯估伴伶伸似但比特低住體何餘佛作你傭佩佳使侄例侍供依偵側僑侮侵便促俊俗俘保信倆儉修俯俱倍倒倘候倚借倡倦債傾假偏停健偶偷償傅傍儲催傲傻像僚僵僻兒元兄兆先光克兔兢入全八公六共兵其具典兼獸內册冒軍冠冤冬冰沖決况冶冷凍淨凉减凑凝幾凡憑凳凶凸凹出函鑿刀刃分切刊刑劃列則剛創初删判利別刮到制刷券刺刻劑剃削前劍剖剝劇剩剪副割劈力功加劣助努劫勵勁勞勢勇勉勒勤勺勻包匕化北匙匠匪醫十午半協卑卒單南博蔔占卡臥印即卻卵卷卸卿廠廳廁厘厚原厦廚去縣又叉及友雙反叔取受敘叛口古句叨只叫召叮可臺史右葉號叼吃各吉名後吏吐向嚇呂嗎君吞否吧噸吩含聽啟吳吵吸吹吼呀呆呈告員嗚呢味呼命和咏咐咬咱咳鹹咽哀品哄哈響啞嘩哥哨哪哭哲唇唉唐喚唯唱啄商啊啦喂喇喉喊喘喝噴嗓嗽嘉囑嘴器囂嚷嚼囊囚四回因園困囪圍固圓圈土聖在地場圾址均坊壞坐坑塊堅壩墳坡坦垂垃壟型壘墾墊垮埋城域培基堂堆堡堤堪堵塌塑塔塘塞填境墓牆增墨壁士壯壺壹複夏夕多夜够大天夫夭夯夷誇夾奇奉奏奔獎套奠奧女奴奶奸她好如妄媽妖妙妥妨妹妻始姐姑姓委薑姥姨姻姿威娃婁嬌娘娛婆婚嬸嫁嫂嫌嫩子孔孕字孫孝孟季孤孩寧它宅宇守安宋完宏宗官宙定宜寶審客宣室宦憲宮宰害宴宵家容寬賓宿寄密寇富寒察寡寨寸寺尋封射將尉尊小尖塵尚尤屍尺尼尾尿局居屈届屋屑展屠屢屯山嶼岔崗島岩嶺嶽岸峽峰崇崖嶄川州巡巢工左巧巨鞏巫己已巴巾布帆希帳帖簾帚幟帝帶席幫常帽幅幕幹年並幸么幻幼幽廣床序庫底店府廢度座庭康廉廊延建開弃弄弊弓引弟張弦彎彈强錄形彩彪彭影役徹彼往征徑待很律徐徒得禦循微德心必憶忌忍志忘忙忠憂快念忽態怎怒怕怖憐思怠急性怨怪戀恐恒恢恨恩恭息恰懇惡惱悄悉悔悟悠患悅您懸悲悼情驚惑惕惜惠懼慘懲慚慣惰想惹愁愈愉意愚感憤愧願慈慌慎慕慢慧慨慰懂懶戈成我戒或戰戚截戶房所扁扇手才紮撲扒扔托扛扣擴揚扭扮扯擾扶批找承技抄把抓投抖抗折撫拋搶護報披抬抱抵抹押抽擔拆拉拌拍拐拒拔拘招拜攏揀擁攔撥擇括拳拴拼拾拿持掛指按挎挖撓擋掙擠揮挨挪振挺挽捆捉捎捏捐捕撈損撿換捧據捷掀授掉掌掏排掘掠探接控推掩掰揉描提插握揪揭援擱摟攪搏搜搞搬搭攜攝擺搖攤摔摘摧摩摸撇撐撒撕撞撤播操擦攀支收改攻放政故效敵敏救教敞散數敲整文斑鬥料斜斤斥斧斬斯新方施旁旅旋族旗既日旦旨旬旭旱時曠旺昂昆昌明昏易昔星映春昨是晝晃晌曬曉暈晚晨景晴晶智暫暑暖暗暮暴曲更最月有朋服朗望朝期木未末本術朱樸朵機朽殺杆李杏材村杜束杠來楊杯松板極構析枕林果枝棗槍枯架柄柏某染柔櫃查柱柳柴柿棟欄栗校株樣核根格栽桂桃框案桌桐桑檔橋槳桶梁梅梢梨梯械梳檢棉棋棍棒棕棘棚森棵椅植椒樓概榆榜榨榴槐槽模橫櫻橘橡欠次欣歐欲欺歇歉歌止正此步武歪歹死殲殃殊殘殖段殷殿毀母斃毛毫毯民氣氧水永汁求汗江池污湯汪汽沃沉沙溝沒沫河沸油治沾沿泄泉泊泛泡波泥注淚泰泳瀉潑澤潔洋灑洗洞津洪洮洲活洽派流淺漿澆濁測濟渾濃浙浩浪浮浴海浸塗消涉湧濤澇潤漲澀液淋淘淡深混淹添清漸漁滲渠渡渣溫港渴遊湖灣濕溉源溜溪滋滑滔滾滿濾濫濱灘滴漂漆漏演漠漫潜潮澡激灌火滅燈灰靈灶灾燦爐炊炎炒炕炭炮炸煉爛烈烘燭烟烤煩燒燙熱焦焰然煌煎煤照煮熄熊熔熟燃燕燥爆爪爬爵父爺爸爹爽版牌牙牛牢牧物牲牽犧犁犬犯狀猶狂狐狗狠狡狹獅獄狸狼獵猛猜猪猫獻猴猾率玉王玩環現玻珍珠班球理琴瑞璃瓜瓣瓦瓶甘甜生用田甲申電男暢界畏留略番疆疏療疤疫瘡瘋疲疼疾病症癢痕痛痰瘦登白百的皆皇皮皺皿盆盈益盞鹽監盒盜盤盛盟目盯盲直相盼盾省眉看真眠眨眯眼著睜睛睡督睬瞎瞞瞧矗矛矢知矩石礦碼砌砍研磚破礎硬確碌碎碑碗碧碰磁磨示禮社祖祝神祟祥祭禍禁福禽禾秀私禿稈秉秋種科秒秘租秤秧秩積稱移稀程稍稅稠穩稻稼稿穆穗穴究空穿突竊窄窑窗竄窩立站章竭端竹竿笋笑筆笛符笨第籠等筋筐築筒答策篩箏籌簽簡算管籮箭箱篇籃籍米粉粒粗粘粟粵粥糧粱精糊糕糖糟糠系素索紫累絮繁糾紅纖約級紀純紗綱納縱紛紙紋紡紐線練組細織終紹經綁絨結繞繪給絡絕絞統絹繡績緒續繩維綿綢綠緞緩編緣縫纏縮繳缸缺罐網罕罰罷罩罪置羊美羔羞羨群羹羽翁翅翠翻翼耀老考者而耍耐耕耗耳耽聶聾職聘聚聰肉肌肚肝腸股肢膚肥肩肯育肺腎腫脹脅胃膽背胖勝胞胡胳膠胸能脂脆脈脊髒腦脖脚脫臉脾臘腐腔腥腰腹騰腿膀膊膏膛膜膝膨臂臣自臭至致臼舀舅舌舍舒舞舟航般艦艙船艇艘良豔藝節芒芝蘆芬花芳芹芽蒼苗若苦英蘋茂範茄茅莖繭茫茶草荒蕩榮藥荷莫蓮獲莽菊菌菜菠萄萌萍蘿營落葛葡董葬葱葵蒙蒜蒸蓄藍蓬蔑蔬蔽蕉薄薪薯藏虎虜虐慮蟲虹蝦蝕蟻螞蚊蠶蛇蛙蛛蠻蛾蜀蜂蜓蜘蜜蠟蜻蠅蝴蝶融螺蠢血行銜街衣補錶衫襯衰襖袋袍袖襪被襲裁裂裝裕裙褲裳裹西要覆見規視覽覺角解言誓警計訂認討讓訓議訊記講許論諷設訪證評識訴診詞譯試詩誠話誕詢該詳語誤誘說誦請諸讀課誰調諒談誼謀謊謎謝謠謙謹譜穀豆象豪貌貝貞負貢財責賢敗貨質販貪貧購貫賤貼貴貸貿費賀賊賄資賭賞賠賴賺賽贊贈贏赤赫走赴趕起趁超越趨趟趣足趴躍跌跑距跟跨跪路跳踐踏踢踩踪蹄蹈蹦蹲躁身躬躲躺車軋轉輪軟轟輕載轎較輔輛輩輝輸辛辜辭辟辣辨辯辮辰辱遼達遷迅迎運近返進遠違連遲迫述迷迹追退適逃逆選透逐遞途逗通逝速造逢逮逸逼遇遍道遺遣遙遭遮遵避邀邑那邪郵鄰郊郎部都鄙配酒酬醬酷酸釀醉醋醒采釋裏重量金針釘釣鐘鋼鑰鉤錢鉗鑽鐵鈴鉛銅鏟銀鑄鋪鏈銷鎖鋤鍋鏽鋒銳錯錫鑼錘錦鍵鋸鍬鍛鎮鏡鐮長門閃閉問闖閏閑間悶閘鬧聞閥閣閱闊隊防陽陰陣階阻阿附降限陝陡院除險陪陵陶陷隆隨隱隔隙障隸難雀雁雄雅集雕雨雪零雷雹霧震黴霍霜霞露霸青靜靠面革鞋鞠鞭韭音韻頁頂頃項順須頑顧頓頌預領頸頻顆題顏額顛顫飄食餐饑飯飲飾飽飼饒餃餅餓餡館饞饅首香馬馱馳驅駁驢駛駐駝駕罵驕駱驗騎騙騾驟骨高鬼魂魄魔魚鮮鳥鳴鴉鴨鴿鹅鵲鷹鹿麥麻黃黍黑默鼎鼓鼠鼻齊齒齡龍龜", 个数);
			}

			/// <summary>
			/// 返回指定个小写英文字母、大写英文字母组成的字符串
			/// </summary>
			public static string 英文字母(uint 个数 = 1u)
			{
				return 当中字符("abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ", 个数);
			}

			/// <summary>
			/// 返回指定个小写英文字母组成的字符串
			/// </summary>
			public static string 小写英文字母(uint 个数 = 1u)
			{
				return 当中字符("abcdefghijklmnopqrstuvwxyz", 个数);
			}

			/// <summary>
			/// 返回指定个大写英文字母组成的字符串
			/// </summary>
			public static string 大写英文字母(uint 个数 = 1u)
			{
				return 当中字符("ABCDEFGHIJKLMNOPQRSTUVWXYZ", 个数);
			}
		}

		/// <summary>
		/// 判断这个数字是否为整数
		/// </summary>
		public static bool 是整数(object 数字)
		{
			if (!类型.是数字(数字.GetType()))
			{
				return false;
			}
			return Operators.ConditionalCompareObjectEqual(数字, Conversion.Fix(RuntimeHelpers.GetObjectValue(数字)), TextCompare: false);
		}

		/// <summary>
		/// 判断这个数字是否为小数
		/// </summary>
		public static bool 是小数(object 数字)
		{
			return !是整数(RuntimeHelpers.GetObjectValue(数字));
		}

		/// <summary>
		/// 判断这个数字是否为偶整数
		/// </summary>
		public static bool 是偶数(object 数字)
		{
			return 是整数(Operators.DivideObject(数字, 2));
		}

		/// <summary>
		/// 判断这个数字是否为奇整数
		/// </summary>
		public static bool 是奇数(object 数字)
		{
			return !是偶数(RuntimeHelpers.GetObjectValue(数字));
		}

		/// <summary>
		/// 把十进制数转为其他进制的字符串，最大36进制
		/// </summary>
		public static string 十进制转(uint 数字, ushort 进制)
		{
			if (进制 < 1)
			{
				return "";
			}
			if (进制 == 1)
			{
				return 文本.重复("0", 数字);
			}
			string text = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
			string text2 = "";
			while ((long)数字 > 0L)
			{
				checked
				{
					text2 = Conversions.ToString(text[(int)unchecked(数字 % 进制)]) + text2;
				}
				数字 /= 进制;
			}
			return text2;
		}

		/// <summary>
		/// 把其他进制的数字字符串变成十进制的Ulong
		/// </summary>
		public static ulong 转十进制(string 数字, ushort 进制)
		{
			if (类型.为空(数字, 进制))
			{
				return 0uL;
			}
			string text = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
			ulong num = 0uL;
			数字 = 文本.筛选字符(数字.ToUpper(), 文本.左(text, 进制));
			int length = 数字.Length;
			checked
			{
				for (int i = 1; i <= length; i++)
				{
					num = (ulong)Math.Round((double)num + (double)text.IndexOf(Strings.GetChar(数字, 数字.Length - i + 1)) * Math.Pow(unchecked((int)进制), i - 1));
				}
				return num;
			}
		}
	}
}
